// Menu
const body = document.querySelector('body');
const menu = document.querySelector('.menu');
const menuToggle = document.querySelector('.menu-toggle');

function toggleMenu() {
  menu.classList.toggle('active');
  menuToggle.classList.toggle('active');
  body.classList.toggle('lock');
}

function closeMenu() {
  menu.classList.remove('active');
  menuToggle.classList.remove('active');
  body.classList.remove('lock');
}

menuToggle.addEventListener('click', toggleMenu);
menu.addEventListener('click', closeMenu);

console.log("(128/150)");
console.log("вёрстка валидная (10/10).");
console.log("вёрстка семантическая: footer, header, main, nav, section, h1, h2, h3, h5 (18/20).");
console.log("для оформления СV используются css-стили (10/10).");
console.log("контент размещается в блоке, который горизонтально центрируется на странице. " +
    "Фоновый цвет, если он есть, тянется во всю ширину страницы (10/10).");
console.log("вёрстка адаптивная: ни на одном из разрешений экрана до 320px включительно не появляется " +
    "горизонтальная полоса прокрутки, при этом всё содержание страницы сохраняется (10/10).");
console.log("есть адаптивное бургер-меню. Ссылки в пунктах меню ведут на основные разделы CV. " +
    "При кликах по пунктам меню реализована плавная прокрутка по якорям (10/10).");
console.log("на странице СV присутствует изображение - фото или аватарка автора CV, пропорции изображения " +
    "не искажены, у изображения есть атрибут alt (может быть пустым) (10/10).");
console.log("контакты для связи и перечень навыков оформлены в виде списка ul > li (10/10).");
console.log("CV содержит контакты для связи, краткую информацию о себе, перечень навыков, " +
    "информацию об образовании и уровне английского (10/10).");
console.log("CV содержит пример вашего кода (например, решение задачи с сайта codewars) с подсветкой кода. " +
    "Для подсветки кода может использоваться js-библиотека, например, highlight.js (0/10).");
console.log("CV содержит изображения-ссылки на выполненные вами проекты. При клике по изображению страница " +
    "проекта открывается в новой вкладке. У каждого проекта есть название, небольшое описание, " +
    "указан перечень используемых технологий (0/10).");
console.log("CV выполнено на английском языке (10/10).");
console.log("выполнены требования к Pull Request: есть ссылка на задание, скриншот страницы СV, " +
    "ссылка на деплой страницы CV на GitHub Pages, выполнена самооценка (самооценку расписываем " +
    "по пунктам критериев оценки, указывая балл за каждый пункт) (10/10).");
console.log("есть видеорезюме автора CV на английском языке. Видеорезюме встраивается в страницу CV как видео, " +
    "а не в виде кнопки или ссылки. Продолжительность видео 3-5 минут (±15 секунд). В описание видео на YouTube " +
    "добавлена ссылка на его транскрипцию на английском языке (например, в документе Google Docs) (0/10).");
console.log("дизайн, оформление, качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к заданию " +
    "(это дополнительные 10 баллов, поэтому некоторый субъективизм в оценке может присутствовать) (10/10).");